<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"1171bbb0b9aab6251ec65bbbfe8d67f3c88953a225b9f8f253aedbd55bb0fc98","plan_job_ref":"Job Plan org changes and list them in a PR #53 at https://github.com/django-commons/controls/actions/runs/10231008857","plan_out_hash":"b34b16f6ae2c17f727a867d825c383186c68209f57d72c4245766ef3856ea3a9","plan_hash":"49be6cc9ffa15902ad024277a8dfc4ece71647feb981199f021c49920c2f575d","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 9 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-tasks-scheduler"] will be updated in-place
!~  resource "github_repository" "this" {
!~      allow_merge_commit          = true -> false
!~      allow_rebase_merge          = true -> false
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
!~      delete_branch_on_merge      = false -> true
!~      has_wiki                    = true -> false
        id                          = "django-tasks-scheduler"
!~      merge_commit_message        = "PR_TITLE" -> "PR_BODY"
!~      merge_commit_title          = "MERGE_MESSAGE" -> "PR_TITLE"
        name                        = "django-tasks-scheduler"
!~      squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
!~      squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
#        (27 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_team.repo_admin_team["django-tasks-scheduler"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-tasks-scheduler repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-tasks-scheduler-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-tasks-scheduler"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-tasks-scheduler repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-tasks-scheduler-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-tasks-scheduler"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-tasks-scheduler repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-tasks-scheduler"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-tasks-scheduler"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "cunla"
        }
    }

  # github_team_members.repo_team_members["django-tasks-scheduler"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "cunla"
        }
    }

  # github_team_repository.repo_admin_team_access["django-tasks-scheduler"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-tasks-scheduler"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-tasks-scheduler"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-tasks-scheduler"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-tasks-scheduler"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-tasks-scheduler"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-tasks-scheduler"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #53](https://github.com/django-commons/controls/actions/runs/10231008857)